app/controllers/products_controller.rb

  def show
    @product = Product.find params[:id]
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]